/** 地图中心 */
export const CENTER = [118.830089, 25.864825];

/** 缩放 */
export const ZOOM = 10.5;

/** 福州 */
export const FUZHOU = [119.300537, 26.07991];

/** 永泰 */
export const YONGTAI = [118.78949, 25.852196];

/** 地热 */
export const GEOTHERMALS = [
  {
    name: "汤坑",
    coordinates: [118.55278015136719, 25.936434630115983],
  },
  {
    name: "汤垄",
    coordinates: [118.88923645019531, 25.954957767123528],
  },
  {
    name: "温埔",
    coordinates: [118.9647674560547, 25.946313999114096],
  },
  {
    name: "葛岭汤埕",
    coordinates: [119.07943725585938, 25.95063596244654],
  },
  {
    name: "岭下",
    coordinates: [118.92288208007812, 25.929642083279973],
  },
  {
    name: "葛岭",
    coordinates: [119.07531738281251, 25.88764310463451],
  },
  {
    name: "永泰县城",
    coordinates: [118.92459869384764, 25.85149966988997],
  },
  {
    name: "",
    coordinates: [118.93798828125, 25.84408426573991],
  },
  {
    name: "荷溪",
    coordinates: [118.88031005859375, 25.826161786611],
  },
  {
    name: "界竹口",
    coordinates: [118.8837432861328, 25.81503612419645],
  },
  {
    name: "大汤",
    coordinates: [118.94451141357422, 25.82863401406832],
  },
  {
    name: "月州",
    coordinates: [118.60633850097658, 25.794327247836158],
  },
  {
    name: "汤星",
    coordinates: [118.81370544433594, 25.756609256777935],
  },
];

/** 交通 - 点 */
export const TRAFFIC_POINTS = [];

/** 交通 - 线 */
export const TRAFFIC_LINES = [];
