import { createInstance } from './utils';
import _, { method } from 'lodash';

const instance = createInstance({
  baseURL: `${process.env.VUE_APP_BASE_URL}/xiangcun/industry`
});

const content = `21个乡镇星罗棋布，一个乡镇就是一道风景；272个村（社区）璀璨夺目，一个村庄就是一抹靓丽。永泰县以敏锐的目光、合理的规划、积极的行动，精准聚力，用“一镇一品”赋能发展，繁荣了多彩产业，甜美了村民生活，延续着一代代本土优势，构建出一个个地域乡愁，让乡村振兴的春风里百花齐放，让村民的致富道路越走越宽。
摘尽枇杷一树金
——塘前乡的枇杷
“东园载酒西园醉，摘尽枇杷一树金”。塘前乡芋坑村平均海拔300米，年平均气温16.9℃，年平均降水量1451mm，非常适合枇杷种植。皮黄、个大、味甜、汁多是芋坑枇杷最大的特点，全村种植面积2700多亩，年产量100多万公斤，产值800多万元，是真正的“一树枇杷一树金”。
 
青梅煮酒论英雄
——葛岭镇的青梅
葛岭镇聚焦青梅产业发展，建设主题观光工厂“梅百华文化创意园”，通过青梅种植、观赏、加工、示范推广，打响“梅文化”品牌，并引进台湾技术，生产适合内销的梅饼、梅酒等青梅制品，影响辐射种植户1000余人，带动每户年增收2万元。青梅可口，如同村民生活的美好滋味。
 
唤醒沉睡的“老屋”
——樟城镇的文创基地
樟城镇城关村利用闲置房屋与企业合作，有效盘活存量资产，在保留房屋原有特色的基础上，将昔日破败不堪、基础设施落后、环境脏乱差的老屋打造成环境优美、设施齐全、充满人文气息的文创基地，既保护了原生态房屋，留住了村集体资产，又为村财增收找到一条新的道路。
 
“花样”农业谋振兴
——城峰镇的农业经营
城峰镇探索农地“三权分置”模式，引导农户规模化、集约化生产经营，提高农业组织化程度，把小农户引入现代农业发展轨道，完善涉农资金统筹整合，优先支持现代农业和新型乡村产业发展，更好地让农民分享农产品的增值收益。农业兴则产业兴，城峰镇“花样”谋振兴。
 
花的世界很清凉
——清凉镇的花海
清凉镇岭下店村主抓“宜居宜游”特色村落建设，发挥交通优势，大力发展油菜花观光产业，油菜花种植面积120多亩，并利用优良的生态环境，流转土地300多亩，开发康养、旅游、文化等产业，推动一二三产业融合发展。在清凉镇，油菜花成了最美的“致富花”。
 
舌尖上的“富泉羊”
——富泉乡的羊肉
富泉产业春光美，风吹草低见名羊。富泉乡利用本土深山林场丰厚草场资源优势，着力打造“富泉羊”品牌。富泉羊是福州三大名羊之一，以黑毛、个小、羊膻味轻、肉质鲜美、胆固醇含量低、蛋白质含量高而闻名。全乡9个村80余户农民养殖富泉羊，年出栏4500多只，年产值700多万元，走出了“以羊致富”的道路。
 
蓬勃发展的“旅游+”
——岭路乡的山与水
岭路乡依托藤山自然保护区生态优势，积极招商引资，将青云山景区、云顶景区建设成为国家4A级旅游景区、国家重点风景名胜区，并打造御温泉康养休闲中心，全乡年游客量30万人次，年均旅游收入1000多万元。穿越境内的211省道是福建省十大生态景观带之一，被誉为“云顶福道”。
 
“芋”见新生活
——赤锡乡的芋头加工
赤锡乡赤锡村通过发展芋头等农作物的种植、加工及仓储产业，带动村民增收致富。建成占地面积2500平方米的农产品加工厂，芋头产品日产量可达18吨，同时可为村民提供60多个就业岗位，每年可为就业农户增收270余万元。芋头虽小，却能种出大财富与新生活。
 
梧桐树下春光美
——梧桐镇的生态
花俏、果香、树古、水清构成梧桐镇醉美的春光。梧桐镇以推进乡村特色产业提质增效为落脚点，培育民宿、共享茶室、生态农场等休闲观光旅游项目；发展油菜花、猕猴桃、水稻种植等产业；建立茉莉花基地，以“公司+基地+农户”的模式，流转村民土地2000余亩，带动村民增收致富。梧桐镇让“生态”变“产业”，美了乡村，富了农民。
. 
诗情画意慢时光
——嵩口镇的特色旅游
嵩口镇积极发展“旅游＋”特色产业，网红民宿、藤编馆、根雕馆、特色咖啡屋等一个个业态闪亮登场，吸引了八方游客前来打卡。成功举办全国乡村复兴论坛·永泰庄寨峰会、华文传媒论坛、中日韩建筑师峰会等大型活动，旅游知名度与日俱增。爱上嵩口只需一个理由——诗情画意慢时光。
 
与羊为伴的有机红茶
——洑口乡的高优红茶
洑口乡紫山村坚持按照有机标准种植茶叶，全程使用山涧泉水灌溉茶树，放养羊群于茶树间施肥，辅以人工除草控制病虫害。茶叶中富集天然健康成分，茶香扑鼻，入口留甘，广受欢迎，不仅给茶农带来收益，也带动洑口乡就业和经济发展。与羊为伴种茶树，体现了村民的大智慧。
 
稻花香里说丰年
——盖洋乡的优质水稻
盖洋乡积极培育新型农业经营主体，成立专业生态农业公司，创办有机水稻生产示范推广基地，大力发展水稻生产，实现连片规模种植。全乡完成高标准农田建设5500多亩，种植大米、糯米、红米、黑米等优质水稻3000多亩。水稻丰收季，满田尽披“黄金甲”，亮出了盖洋生态农业的新名片。 
 
小花生的“钱”景
——长庆镇的花生
一公斤能卖到60元左右的花生，就产自长庆镇。长庆镇通过引进优质花生品种，依托好山好水好空气的生态优势，打响了“长庆5号”花生品牌。全镇种植花生2500多亩，平均每亩为农户带来6000余元经济效益。除了一产的特色农业，还延伸出二产的精加工、三产的“花生+”乡村游，一二三产滚动发展，为长庆镇带来可观“钱”景。
 
旅游摄影点亮“美丽经济”
——东洋乡的星空
   东洋乡利用秀峰仙景点和国保绍安庄，打造“户外露营+摄影”和“美学实践创作”基地，吸引户外运动、天文爱好者。同时，通过“互联网电商+基地+农家乐”的运营模式，建设福州大学社会实践基地、户外露营摄影基地、茶油体验工坊、秀峰仙民宿以及农家乐等特色文旅项目，盘活文化资产，吸引特定人群打卡，带动村民增收致富。

芳香味津润如酥
——霞拔乡的油茶
霞拔乡立足生态资源优势，着力发展现代高效农业，通过引进农业企业，流转土地1500多亩，打造福长村油茶产业基地。企业与农户建立联结机制，开发土地资源，发展不同主题产业，是霞拔乡产业振兴的一个特点，福长村仅油茶一项就使当地农户增收270余万元。油茶醉人，酿成了霞拔村民的醉美生活。
 
“茶芋共织同安味”
——同安镇的茶叶和芋头
茶叶和芋头是同安镇的两张名片，全镇种植茶叶8000多亩、芋头4000多亩。引进规模化生产茶企5家，改进生产工艺，延伸产业链条，茶旅小镇茶产业园区初见规模；推广“基地+合作社+农户”模式，发展芋头种植大户17家，带动12个村种植槟榔芋。茶芋泛香，实现了从农产品到农旅产品的华丽转身。
 
“萄”醉大洋
——大洋镇的休闲生态
大洋镇溪墘村生态优美，空气清新，是旅游、避暑、度假胜地。溪墘村立足生态优势，盘活集体资产，建设集农产品生产、休闲娱乐、观光旅游为一体的生态园，助力扶贫开发成果巩固，不仅增加了村财收入，更丰富了群众生产生活。定期举办生态产品主题活动吸引游客，提升了大洋休闲生态农业品牌知名度。
 
映日荷花别样红
——盘谷乡的“荷”经济
“接天莲叶无穷碧，映日荷花别样红。”炎炎夏日，盘谷乡荷花绽放，风姿绰约、分外美丽，吸引众多游客前来观赏。近年来，盘谷乡转变传统单一耕地模式，在推进旅游产业发展的同时，发展独特的“荷”下经济，在荷花池中套养小龙虾、泥鳅等水产品，充分利用生态资源，增加经济效益。
 
野生中药材的生长宝地
——红星乡林下中药材种植基地
红星乡气候温和、天蓝水清、阔叶林密集，有丰厚的腐殖土壤，为林下中药材种植提供了适宜的生长环境。林下种植能有效防止水土流失、增强土壤肥力，对维护生态环境有着重要的意义，实现经济效益与生态效益双丰收。川山“香草谷”占地800亩，种植铁皮石斛、金花茶、洛神花和杜鹃兰等，被评为福州市杜鹃兰种植示范基地。
 
御医故里 ，“鹿力”同兴
——白云乡的御医文化
白云乡樟洋村绿茵掩映、环境幽静，烟雾缭绕、气候宜人，是中国中西医结合先行者力钧的故乡。樟洋村依托力钧文化，走文化休闲旅游的乡村振兴之路，倾力打造“白云深处，御医故里”文化品牌。同时，因珍稀动物麋鹿与御医故里文化意境相符，引入麋鹿，建成全国第四个麋鹿园。
 
打“绿色牌”，收“金果实”
——丹云乡的中草药
丹云乡以“中草药精品乡”为发展定位，依托良好生态资源，通过林下种植与田地种植相结合，大力发展中草药种植，全乡种植规模达3000多亩，主要有三叶青、铁皮石斛、灵芝、黄精等珍贵品种，并配套建设观光果园200亩、田地作物600亩，深得群众和社会各界好评。
`;


/**
 * 产业地图-根据乡镇名称获取乡镇介绍
 * @param {string} town
 */
export function fetchStreetDetail(town) {
  if ('一镇一品' === town) {
    return {
      content: content,
      media: [
        { src: 'https://zhengxinyun.oss-cn-guangzhou.aliyuncs.com/xiangcun/icon/yiXiangYiPing/chanye1.jpg', type: 'image' },
        { src: 'https://zhengxinyun.oss-cn-guangzhou.aliyuncs.com/xiangcun/icon/yiXiangYiPing/chanye2.jpg', type: 'image' },
        { src: 'https://zhengxinyun.oss-cn-guangzhou.aliyuncs.com/xiangcun/icon/yiXiangYiPing/chanye3.jpg', type: 'image' },
        { src: 'https://zhengxinyun.oss-cn-guangzhou.aliyuncs.com/xiangcun/icon/yiXiangYiPing/chanye4.jpg', type: 'image' }
      ],
    };
  }
  return instance.post('/getTownInfo', { town }).then(({ result }) => ({
    content: result.content,
    media: _.map(result.fileList, ({ filePath, fileType }) => ({
      src: filePath,
      type:
        fileType === '.jpg' || fileType === '.png' || fileType === '.jpeg'
          ? 'image'
          : 'video'
    }))
  }));
}

/**
 * 产业地图-获取村庄数据
 * @param {string} village
 */
export function fetchVillageDetail(village, division) {
  return instance.post('/villageData', { village, division }).then(({ result }) => result);
}

/**
 * 产业地图-乡村振兴项目(工作成效)
 * @param {string} name
 * @param {string} mapLevel
 * @param {string} projectClass
 */
export function fetchWorkData(name, mapLevel, projectClass = 'project_szx') {
  return instance.post('/workData', { name, mapLevel, projectClass }).then(({ result }) => result);
}

/**
 * 产业地图-特色产业和自然资源
 * @param {string} town
 * @param {string} type
 */
export function fetchNatures(town, type) {
  return instance.post('/natures', { town, type }).then(({ result }) =>
    _.map(result,
      ({ id, latitudes, longitudes, icon, content, name, village }) => ({
        id,
        position: [longitudes, latitudes],
        icon,
        name,
        content,
        village
      })
    )
  );
}

/**
 * 产业地图-获取村下所有项目以及坐标
 * @param {string} village
 */
export function fetchProjectByVillage(village) {
  return instance.post('/projectByVillage', { village }).then(({ result }) => _.map(result,
    ({ latitudes, longitudes, ...result }) => ({
      ...result,
      position: [longitudes, latitudes]
    })
  )
  );
}
